Tekla Open API Reference for Tekla Structures 2025
ViewVisibilitySettings.ComponentsVisibleInComponents Property
 Gets or sets the component symbol visibility inside components.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ComponentsVisibleInComponents { get; set; }
Public Property ComponentsVisibleInComponents As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewVisibilitySettings Class
Tekla.Structures.Model.UI Namespace